<?php
include "../../mainfile.php";
include "../../header.php";
include "./connect_city_ex2.php";
//$id = $_SESSION['id'];
$id = $_GET["id"];
$sid = $_POST["sid"];

$a130 = $_POST["pass"];	//縣市審核狀態
$a131 = $_POST['a131'];	//縣市審核意見

$a132 = $_POST["a132"];	//本項目總額

$a135 = $_POST['a135'];	//子項目一總額
$a136 = $_POST['a136'];
$a137 = $_POST['a137'];

$a138 = $_POST['a138'];	//子項目二總額
$a139 = $_POST['a139'];
$a140 = $_POST['a140'];

$a133 = $a136 + $a139;	//本項目經常門
$a134 = $a137 + $a140;	//本項目資本門
if($a130=='2'){
	$a132=0;
	$a133=0;
	$a134=0;
	$a135=0;
	$a136=0;
	$a137=0;
	$a138=0;
	$a139=0;
	$a140=0;
	$a141=0;
	$a142=0;
	$a143=0;
	$a144=0;
	$a145=0;
	$a146=0;
	$a147=0;
	$a148=0;
	$a149=0;
}

//$allowance=$_POST["allowance"];

$a030 = $_POST['a030'];	//科目
$a031 = $_POST['a031'];	//類別

$a040 = $_POST['a040'];
$a041 = $_POST['a041'];

$a050 = $_POST['a050'];
$a051 = $_POST['a051'];

$a060 = $_POST['a060'];
$a061 = $_POST['a061'];

$a070 = $_POST['a070'];
$a071 = $_POST['a071'];

$a080 = $_POST['a080'];
$a081 = $_POST['a081'];

$a090 = $_POST['a090'];
$a091 = $_POST['a091'];

$a100 = $_POST['a100'];
$a101 = $_POST['a101'];

$a110 = $_POST['a110'];
$a111 = $_POST['a111'];

$a120 = $_POST['a120'];
$a121 = $_POST['a121'];
$a122 = $_POST['a122'];

$a150 = $_POST['a150'];	//縣市經費表資料
$a151 = $_POST['a151'];
$a152 = $_POST['a152'];
$a153 = $_POST['a153'];
$a154 = $_POST['a154'];
$a155 = $_POST['a155'];
$a156 = $_POST['a156'];
$a157 = $_POST['a157'];
$a158 = $_POST['a158'];
$a159 = $_POST['a159'];
$a160 = $_POST['a160'];
$a161 = $_POST['a161'];
$a162 = $_POST['a162'];
$a163 = $_POST['a163'];
$a164 = $_POST['a164'];
$a165 = $_POST['a165'];
$a166 = $_POST['a166'];
$a167 = $_POST['a167'];
$a168 = $_POST['a168'];
$a169 = $_POST['a169'];
$a170 = $_POST['a170'];
$a171 = $_POST['a171'];
$a172 = $_POST['a172'];
$a173 = $_POST['a173'];
$a174 = $_POST['a174'];
$a175 = $_POST['a175'];
$a176 = $_POST['a176'];
$a177 = $_POST['a177'];
$a178 = $_POST['a178'];
$a179 = $_POST['a179'];
$a180 = $_POST['a180'];
$a181 = $_POST['a181'];
$a182 = $_POST['a182'];
$a183 = $_POST['a183'];
$a184 = $_POST['a184'];
$a185 = $_POST['a185'];
$a186 = $_POST['a186'];
$a187 = $_POST['a187'];
$a188 = $_POST['a188'];
$a189 = $_POST['a189'];

if($a130=='2'){
	$a150=0;
	$a154=0;
	$a158=0;
	$a162=0;
	$a166=0;
	$a170=0;
	$a174=0;
	$a178=0;
	$a182=0;
	$a186=0;
}

$sql = "update 102allowance5 set 
a130='$a130', 
a131='$a131', 
a132='$a132', 
a133='$a133', 
a134='$a134', 
a135='$a135', 
a136='$a136', 
a137='$a137', 
a138='$a138', 
a139='$a139', 
a140='$a140', 
a141='$a141', 
a142='$a142', 
a143='$a143', 
a144='$a144', 
a145='$a145', 
a146='$a146', 
a147='$a147', 
a148='$a148', 
a149='$a149', 

a030='$a030', 
a031='$a031', 
a040='$a040', 
a041='$a041', 
a050='$a050', 
a051='$a051', 
a060='$a060', 
a061='$a061', 
a070='$a070', 
a071='$a071', 
a080='$a080', 
a081='$a081', 
a090='$a090', 
a091='$a091', 
a100='$a100', 
a101='$a101', 
a110='$a110', 
a111='$a111', 
a120='$a120', 
a121='$a121', 
a122='$a122', 

a150='$a150', 
a151='$a151', 
a152='$a152', 
a153='$a153', 
a154='$a154', 
a155='$a155', 
a156='$a156', 
a157='$a157', 
a158='$a158', 
a159='$a159', 
a160='$a160', 
a161='$a161', 
a162='$a162', 
a163='$a163', 
a164='$a164', 
a165='$a165', 
a166='$a166', 
a167='$a167', 
a168='$a168', 
a169='$a169', 
a170='$a170', 
a171='$a171', 
a172='$a172', 
a173='$a173', 
a174='$a174', 
a175='$a175', 
a176='$a176', 
a177='$a177', 
a178='$a178', 
a179='$a179', 
a180='$a180', 
a181='$a181', 
a182='$a182', 
a183='$a183', 
a184='$a184', 
a185='$a185', 
a186='$a186', 
a187='$a187', 
a188='$a188', 
a189='$a189',
a250='$email',
a251='$username' 
where account='$id'";
mysql_query($sql);
//↑a190 ='$email' 刪除，補助項目的a190是複審狀態專用(email資料先移到a250)

//經費表二
$b030 = $_POST['b030'];	//科目
$b031 = $_POST['b031'];	//類別

$b040 = $_POST['b040'];
$b041 = $_POST['b041'];

$b050 = $_POST['b050'];
$b051 = $_POST['b051'];

$b060 = $_POST['b060'];
$b061 = $_POST['b061'];

$b070 = $_POST['b070'];
$b071 = $_POST['b071'];

$b080 = $_POST['b080'];
$b081 = $_POST['b081'];

$b090 = $_POST['b090'];
$b091 = $_POST['b091'];

$b100 = $_POST['b100'];
$b101 = $_POST['b101'];

$b110 = $_POST['b110'];
$b111 = $_POST['b111'];

$b120 = $_POST['b120'];
$b121 = $_POST['b121'];
$b122 = $_POST['b122'];

$b150 = $_POST['b150'];	//縣市經費表資料
$b151 = $_POST['b151'];
$b152 = $_POST['b152'];
$b153 = $_POST['b153'];
$b154 = $_POST['b154'];
$b155 = $_POST['b155'];
$b156 = $_POST['b156'];
$b157 = $_POST['b157'];
$b158 = $_POST['b158'];
$b159 = $_POST['b159'];
$b160 = $_POST['b160'];
$b161 = $_POST['b161'];
$b162 = $_POST['b162'];
$b163 = $_POST['b163'];
$b164 = $_POST['b164'];
$b165 = $_POST['b165'];
$b166 = $_POST['b166'];
$b167 = $_POST['b167'];
$b168 = $_POST['b168'];
$b169 = $_POST['b169'];
$b170 = $_POST['b170'];
$b171 = $_POST['b171'];
$b172 = $_POST['b172'];
$b173 = $_POST['b173'];
$b174 = $_POST['b174'];
$b175 = $_POST['b175'];
$b176 = $_POST['b176'];
$b177 = $_POST['b177'];
$b178 = $_POST['b178'];
$b179 = $_POST['b179'];
$b180 = $_POST['b180'];
$b181 = $_POST['b181'];
$b182 = $_POST['b182'];
$b183 = $_POST['b183'];
$b184 = $_POST['b184'];
$b185 = $_POST['b185'];
$b186 = $_POST['b186'];
$b187 = $_POST['b187'];
$b188 = $_POST['b188'];
$b189 = $_POST['b189'];

if($a130=='2'){
	$b150=0;
	$b154=0;
	$b158=0;
	$b162=0;
	$b166=0;
	$b170=0;
	$b174=0;
	$b178=0;
	$b182=0;
	$b186=0;
}

$sql = "update 102allowance5_2 set 
a030='$b030', 
a031='$b031', 
a040='$b040', 
a041='$b041', 
a050='$b050', 
a051='$b051', 
a060='$b060', 
a061='$b061', 
a070='$b070', 
a071='$b071', 
a080='$b080', 
a081='$b081', 
a090='$b090', 
a091='$b091', 
a100='$b100', 
a101='$b101', 
a110='$b110', 
a111='$b111', 
a120='$b120', 
a121='$b121', 
a122='$b122', 

a150='$b150', 
a151='$b151', 
a152='$b152', 
a153='$b153', 
a154='$b154', 
a155='$b155', 
a156='$b156', 
a157='$b157', 
a158='$b158', 
a159='$b159', 
a160='$b160', 
a161='$b161', 
a162='$b162', 
a163='$b163', 
a164='$b164', 
a165='$b165', 
a166='$b166', 
a167='$b167', 
a168='$b168', 
a169='$b169', 
a170='$b170', 
a171='$b171', 
a172='$b172', 
a173='$b173', 
a174='$b174', 
a175='$b175', 
a176='$b176', 
a177='$b177', 
a178='$b178', 
a179='$b179', 
a180='$b180', 
a181='$b181', 
a182='$b182', 
a183='$b183', 
a184='$b184', 
a185='$b185', 
a186='$b186', 
a187='$b187', 
a188='$b188', 
a189='$b189',
a250='$email',
a251='$username'  
where account='$id'";
mysql_query($sql);

//寫入是否審核通過
	$sql = "update 102schooldata set a196 = '$a130' where account='$id'";
	mysql_query($sql);

//寫入審查委員代號
  $sql = "update school_checkdate set  money_ex5 = '$username' where account='$id'";

//更新資料庫
if(mysql_query($sql)){
	echo '新增成功!';
	//echo '<meta http-equiv=REFRESH CONTENT=2;url=a1_examine_table.php>';
	//改由最後面的JavaScript關閉此視窗
}else{
	echo '新增失敗';
	echo '<meta http-equiv=REFRESH CONTENT=2;url=../../user.php?op=logout>';
}

//include "../../footer.php";
?>
<script language="JavaScript">
setTimeout( "window.close();", 1000 );
</script>